app/views/ecns/_revision_fields.html.erb

    <%= f.label :disposition_work_in_progress %><br />
    <%= f.select :disposition_wip, Revision::DISPOSITION_TYPES, prompt: 'Select Disposition' %>
---
SELECT "revisions".* FROM "revisions" WHERE "revisions"."ecn_id" = 6