app/controllers/drawings_controller.rb

  def index
      order = sortable_column_order, "drawing_number desc"
    if params[:drawings].nil?
       @drawings = Drawing.paginate page: params[:page], order: order, per_page: 100
    else
      @drawings = Drawing\
      .by_description(params[:drawings][:description])\
      .by_drawing_number(params[:drawings][:drawing_number])\
      .by_item_number(params[:drawings][:item_number]).by_pump_model(params[:drawings][:pump_model])\
      .by_frame_size(params[:drawings][:frame_size])\
      .by_part_type(params[:drawings][:part_type])\
      .by_created_before(params[:drawings]['created_before(1i)'], params[:drawings]['created_before(2i)'], params[:drawings]['created_before(3i)'])\
      .by_created_after(params[:drawings]['created_after(1i)'], params[:drawings]['created_after(2i)'], params[:drawings]['created_after(3i)'])\
      .paginate page: params[:page], order: order, per_page: 100
---
SELECT "drawings".* FROM "drawings" WHERE (description LIKE '%%') AND (drawing_number LIKE '%%') AND (item_number LIKE '%%') AND (pump_model LIKE '%%') AND (frame_size LIKE '%%') AND (part_type LIKE '%%') AND (created_on <= '1985-03-03') AND (created_on >= '2013-04-23')
SELECT "drawings".* FROM "drawings" WHERE (("drawings"."description" LIKE 'cas'))

  def show
    @drawing = Drawing.find(params[:id])
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @drawing = Drawing.find(params[:id])
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = ? LIMIT 1  [["id", "11"]]

  def create
    @drawing = Drawing.new(params[:drawing])

    respond_to do |format|
      if @drawing.save
---
INSERT INTO "drawings" ("comments", "created_at", "created_on", "description", "drawing_number", "file_format", "file_location", "frame_size", "item_number", "make_from", "part_type", "pump_model", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @drawing = Drawing.find(params[:id])

    respond_to do |format|
      if @drawing.update_attributes(params[:drawing])
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "drawings" SET "created_on" = '2013-08-31', "updated_at" = '2013-09-01 20:31:05.700007' WHERE "drawings"."id" = 11

  def destroy
    @drawing = Drawing.find(params[:id])
    @drawing.destroy
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "drawings" WHERE "drawings"."id" = ?  [["id", 2]]