app/controllers/ecns_controller.rb

SELECT "ecns".* FROM "ecns"
---
  def index
    if params[:ecns].nil?
       @ecns = Ecn.all

SELECT "ecns".* FROM "ecns" WHERE "ecns"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @ecn = Ecn.find(params[:id])

SELECT "ecns".* FROM "ecns" WHERE "ecns"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @ecn = Ecn.find(params[:id])

INSERT INTO "ecns" ("created_at", "created_on", "distribute_engineering", "distribute_finance", "distribute_india", "distribute_inventory", "distribute_manufacturing", "distribute_planning", "distribute_purchasing", "distribute_qantel", "distribute_quality", "distribute_sales", "ecn_number", "ecn_type", "product_line", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ecn = Ecn.new(params[:ecn])

    respond_to do |format|
      if @ecn.save

SELECT "ecns".* FROM "ecns" WHERE "ecns"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "ecns" SET "ecn_type" = 'Part Modification', "product_line" = 'S3', "distribute_engineering" = 't', "distribute_purchasing" = 't', "distribute_planning" = 't', "distribute_manufacturing" = 't', "distribute_qantel" = 't', "distribute_india" = 't', "updated_at" = '2013-09-02 05:07:23.215013' WHERE "ecns"."id" = 6
---
  def update
    @ecn = Ecn.find(params[:id])

    respond_to do |format|
      if @ecn.update_attributes(params[:ecn])

SELECT "ecns".* FROM "ecns" WHERE "ecns"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "ecns" WHERE "ecns"."id" = ?  [["id", 3]]
---
  def destroy
    @ecn = Ecn.find(params[:id])
    @ecn.destroy