app/controllers/revisions_controller.rb

  def index
    @revisions = Revision.all
---
SELECT "revisions".* FROM "revisions"

  def show
    @revision = Revision.find(params[:id])
---
SELECT "revisions".* FROM "revisions" WHERE "revisions"."id" = ? LIMIT 1  [["id", "1"]]

  def create

    @revision = Revision.new(params[:revision])

    respond_to do |format|
      if @revision.save
---
INSERT INTO "revisions" ("change", "created_at", "disposition_inventory", "disposition_wip", "justification", "quantity_in_qantel", "rev_level", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)